import { ICategory } from '../utils/types/categories/category.interface';
import {
  Category,
  Category as CategoryEnum,
} from '../utils/types/categories/category.enum';
import { IFood } from '../utils/types/foods/food.interface';

// const sandwichList: IFood[] = [
//   {
//     name: 'ساندویچ ویژه',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + قارچ + پنیر',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/sandwich-image-1.jpg',
//     images: [
//       '/images/foods/sandwich-special-1.webp',
//       '/images/foods/sandwich-special-2.webp',
//       '/images/foods/sandwich-special-3.webp',
//     ],
//     category: Category.SANDWICH,
//   },
//   {
//     name: 'ساندویچ هات داگ',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + قارچ + پنیر',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/sandwich-image-2.jpg',
//     images: [
//       '/images/foods/hot-dog-1.webp',
//       '/images/foods/hot-dog-2.jpg',
//       '/images/foods/hot-dog-3.jpg',
//     ],
//     category: Category.SANDWICH,
//   },
//   {
//     name: 'ساندویچ گوشت',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + قارچ + پنیر',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/sandwich-image-3.jpg',
//     images: [
//       '/images/foods/roast-beef-sandwich-1.jpg',
//       '/images/foods/roast-beef-sandwich-2.jpg',
//       '/images/foods/roast-beef-sandwich-3.jpg',
//     ],
//     category: Category.SANDWICH,
//   },
//   {
//     name: 'ساندویچ مرغ',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + قارچ + پنیر',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/sandwich-image-1.jpg',
//     images: [
//       '/images/foods/chicken-sandwich-1.jpg',
//       '/images/foods/chicken-sandwich-2.jpg',
//       '/images/foods/chicken-sandwich-3.jpg',
//     ],
//     category: Category.SANDWICH,
//   },
// ];

// const burgerList: IFood[] = [
//   {
//     name: 'برگر ویژه',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + پنیر ویژه + گوجه + خیارشور',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/burger-image-1.jpg',
//     images: [
//       '/images/foods/burger-special-1.webp',
//       '/images/foods/burger-special-2.jpg',
//       '/images/foods/burger-special-3.jpg',
//     ],
//     category: Category.BURGER,
//   },
//   {
//     name: 'چیز برگر',
//     integredients: 'گوشت گوساله + ژامبون مخصوص + پنیر ویژه + گوجه + خیارشور',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/burger-image-1.jpg',
//     images: [
//       '/images/foods/cheese-burger-1.png',
//       '/images/foods/cheese-burger-2.png',
//       '/images/foods/cheese-burger-3.jpg',
//     ],
//     category: Category.BURGER,
//   },
//   {
//     name: 'چیکن برگر',
//     integredients: 'گوشت مرغ + ژامبون مخصوص + پنیر ویژه + گوجه + خیارشور',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/burger-image-2.jpg',
//     images: [
//       '/images/foods/chicken-burger-1.png',
//       '/images/foods/chicken-burger-2.png',
//       '/images/foods/chicken-burger-3.jpg',
//     ],
//     category: Category.BURGER,
//   },
//   {
//     name: 'ماشروم برگر',
//     integredients:
//       'گوشت گوساله + ژامبون مخصوص + پنیر ویژه + گوجه + خیارشور، قارچ',
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     likes: [],
//     comments: [],
//     price: 120,
//     coverImage: '/images/burger-image-2.jpg',
//     images: [
//       '/images/foods/mushroom-burger-1.png',
//       '/images/foods/mushroom-burger-2.png',
//       '/images/foods/mushroom-burger-3.jpg',
//     ],
//     category: Category.BURGER,
//   },
// ];

// const pizzaList: IFood[] = [
//   {
//     name: 'پیتزا ویژه',
//     integredients: 'ژامبون، سوسیس ویژه، قارچ، گوشت چرخ کرده',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/pizza-image-2.jpg',
//     images: [
//       '/images/foods/pizza-special-1.jpg',
//       '/images/foods/pizza-special-2.webp',
//       '/images/foods/pizza-special-3.jpg',
//     ],
//     price: 150,
//     category: Category.PIZZA,
//   },
//   {
//     name: 'پیتزا پپرونی',
//     integredients: 'کالباس پپرونی، سوسیس ویژه، قارچ، پنیر ویژه',
//     likes: [],
//     comments: [],
//     details:
//       'پیتزا پپرونی یکی از انواع پیتزاهای معروف و بسیار پرطرفدار در جهان است که در کشور عزیزمان ایران هم طرفداران بسیاری دارد. این پیتزا با یک نوع سوسیس مخصوص تهیه می شود که پپرونی نام دارد و به همین دلیل با نام پیتزا پپرونی شناخته می شود.',
//     coverImage: '/images/pizza-image-3.jpg',
//     images: [
//       '/images/foods/pizza-peperoni-1.webp',
//       '/images/foods/pizza-peperoni-2.webp',
//       '/images/foods/pizza-peperoni-3.jpg',
//     ],
//     price: 110,
//     category: Category.PIZZA,
//   },
//   {
//     name: 'پیتزا مخصوص',
//     integredients: 'ژامبون، سوسیس ویژه، قارچريا، گوشت چرخ کرده',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/pizza-image-2.jpg',
//     images: [
//       '/images/foods/pizza-special-4.jpg',
//       '/images/foods/pizza-special-5.jpeg',
//       '/images/foods/pizza-special-6.jpeg',
//     ],
//     price: 180,
//     category: Category.PIZZA,
//   },
//   {
//     name: 'پیتزا مرغ',
//     integredients: 'مرغ، قارچ، پنیر ویژه',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/pizza-image-1.jpg',
//     images: [
//       '/images/foods/pizza-chicken-1.jpg',
//       '/images/foods/pizza-chicken-2.jpg',
//       '/images/foods/pizza-chicken-3.webp',
//     ],
//     price: 120,
//     category: Category.PIZZA,
//   },
//   {
//     name: 'پیتزا گوشت و قارچ',
//     integredients: 'گوشت چرخ کرده، قارچ، پنیر ویژه، سوسیس',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/pizza-image-1.jpg',
//     images: [
//       '/images/foods/pizza-roast-beef-1.jpg',
//       '/images/foods/pizza-roast-beef-2.jpg',
//       '/images/foods/pizza-roast-beef-3.jpg',
//     ],
//     price: 200,
//     category: Category.PIZZA,
//   },
//   {
//     name: 'پیتزا سبزیجات',
//     integredients: 'گوجه، قارچ، فل فل سبز، زیتون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/pizza-image-1.jpg',
//     images: [
//       '/images/foods/pizza-vegetables-1.jpg',
//       '/images/foods/pizza-vegetables-2.jpg',
//       '/images/foods/pizza-vegetables-3.jpg',
//     ],
//     price: 110,
//     category: Category.PIZZA,
//   },
// ];

// export const friesList: IFood[] = [
//   {
//     name: 'سیب زمینی ویژه',
//     integredients: 'سیبزمینی سرخ شده، قارچ، پنیر، ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/fries/special-mushroom-fries.webp',
//     price: 80,
//     category: Category.FRIES,
//   },
//   {
//     name: 'سیب زمینی با سس قارج',
//     integredients: 'سیبزمینی سرخ شده، قارچ، پنیر، سس قارچ',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/fries/fries-mushroom-sauce.jpg',
//     price: 60,
//     category: Category.FRIES,
//   },
//   {
//     name: 'سیب زمینی ساده',
//     integredients: 'سیبزمینی سرخ شده، سس مخصوص',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/fries/simple-fries.jpg',
//     price: 80,
//     category: Category.FRIES,
//   },
//   {
//     name: 'سیب زمینی با قارج',
//     integredients: 'سیبزمینی سرخ شده، قارچ، پنیر، ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/fries/mushroom-fries.webp',
//     price: 80,
//     category: Category.FRIES,
//   },
// ];

// export const saladList: IFood[] = [
//   {
//     name: 'سالاد ویژه',
//     integredients: 'کاهو, کلم, مرغ, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/special-salad.jpeg',
//     price: 80,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد مخصوص',
//     integredients: 'کاهو, کلم, مرغ, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/healthy-green-salad-with-fresh-vegetables.jpg',
//     price: 70,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد سالمون',
//     integredients: 'کاهو, ماهی سالمون, قارچ, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/salmon-avocado-salad.jpg',
//     price: 100,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد کرفس',
//     integredients: 'کرفس, کلم, مرغ, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/special-salad.jpeg',
//     price: 90,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد پیاز',
//     integredients: 'کاهو, کلم, پیاز, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/onion-salad.jpg',
//     price: 60,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد میوه',
//     integredients: 'کاهو, کلم, مرغ, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/fruit-salad.jpg',
//     price: 80,
//     category: Category.SALAD,
//   },
//   {
//     name: 'سالاد پنیر',
//     integredients: 'کاهو, کلم, پنیر, ژامبون',
//     likes: [],
//     comments: [],
//     details:
//       'همه چیز به سلیقه خودتان بستگی دارد. می‌توانید با ژامبون‌های محبوبتان یک پیتزا مخصوص آماده کنید، یا اینکه برای مهمان‌های گیاهخوارتان یک پیتزای مخصوص گیاهی تهیه کنید و سبزیجات رنگارنگ را روی نان پیتزا بچینید. ما امروز طرز تهیه پیتزا مخصوص را با گوشت و ژامبون به شما آموزش می‌دهیم، اما قرار نیست شما هم دقیقا از همین مسیر بروید. برای تهیه این پیتزا هیچ چیز نمی‌تواند شما را محدود کند. کافی است یک نان پیتزای آماده را در سینی بگذارید، مواد دلخواهتان را همانطور که دوست دارید رویش بچینید و با پنیرهای محبوبتان پیتزا را بپوشانید؛ به همین سادگی یک پیتزای مخصوص خوشمزه خوشمزه خواهید داشت.',
//     coverImage: '/images/salads/special-salad.jpeg',
//     price: 70,
//     category: Category.SALAD,
//   },
// ];

// export const FoodImages

// export const FOODS: IFood[] = [
//   ...pizzaList,
//   ...burgerList,
//   ...sandwichList,
//   ...saladList,
//   ...friesList,
// ];

export const CATEGORIES: ICategory[] = [
  {
    name: CategoryEnum.ALL,
    image: '/images/category/category-all.webp',
    title: 'همه',
  },
  {
    name: CategoryEnum.PIZZA,
    image: '/images/category/category-pizza.png',
    title: 'پیتزا',
  },
  {
    name: CategoryEnum.BURGER,
    image: '/images/category/category-burger.svg',
    title: 'برگر',
  },
  {
    name: CategoryEnum.SANDWICH,
    image: '/images/category/category-sandwitch.svg',
    title: 'ساندویچ',
  },
  {
    name: CategoryEnum.FRIES,
    image: '/images/category/category-fries.svg',
    title: 'سیبزمینی',
  },
  {
    name: CategoryEnum.SALAD,
    image: '/images/category/category-salad.svg',
    title: 'سالاد',
  },
  {
    name: CategoryEnum.DRINK,
    image: '/images/category/category-drink.svg',
    title: 'نوشیدنی',
  },
];
